---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.SetColor(Autodesk.Revit.DB.Color)
source: html/8020939e-7696-2c9e-7e8d-4762f0503f41.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.SetColor Method

set color

## Syntax (C#)
```csharp
public void SetColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - color

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null